RIET/src/Catalogs/Реестры/Реестры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Реестры</name>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Координатор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияОтПодрядчика</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОказанияУслугНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОказанияУслугОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подрядчик</name>
    <type>
      <types>CatalogRef.ServiceProviders</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПлательщик</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.RegionProvince</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесоблюденияСроков</name>
    <type>
      <types>CatalogRef.OutOfComplianceReasons</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФинализации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециалистБиллинга</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозврата</name>
    <type>
      <types>CatalogRef.OutOfComplianceReasons</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФинализацииБиллингом</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаНесоблюденияСроковБиллингом</name>
    <type>
      <types>CatalogRef.OutOfComplianceReasons</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикиСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричиныБиллингСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Поставки</name>
    <attributes>
      <name>Поставка</name>
      <type>
        <types>DocumentRef.TripNonLawsonCompanies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Плательщики</name>
    <attributes>
      <name>Плательщик</name>
      <type>
        <types>CatalogRef.SoldTo</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричиныНесоблюденияСроков</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.OutOfComplianceReasons</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричиныНесоблюденияСроковБиллинг</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.OutOfComplianceReasons</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричиныВозврата</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.OutOfComplianceReasons</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

RIET/src/Catalogs/Реестры/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"Подрядчик",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"Координатор",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"СпециалистБиллинга",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"ПериодОказанияУслугНачало",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"ПериодОказанияУслугОкончание",
	ПараметрыСеанса.ТекущийПользователь,
	ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
	,
	Ложь,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список,
	"Ссылка.ПометкаУдаления",
	Ложь,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	Истина,
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
КонецПроцедуры
